Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                                 height = 3
+                                       width  = 1
+                                       x      = 0
+                                       y      = 8
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "Read bytes"
+                                                       formula = "query1"
                                                    },
+                                                   {
+                                                       alias   = "Write bytes"
+                                                       formula = "query2"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:ecs.fargate.io.bytes.read{service:$Application.value,env:$Environment.value}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query2"
+                                                       query       = "avg:ecs.fargate.io.bytes.write{service:$Application.value,env:$Environment.value}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Service Read/Write Bytes"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 5
+                                       x      = 1
+                                       y      = 8
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "Read bytes"
+                                                       formula = "query1"
                                                    },
+                                                   {
+                                                       alias   = "Write bytes"
+                                                       formula = "query2"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:ecs.fargate.io.bytes.read{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query2"
+                                                       query       = "avg:ecs.fargate.io.bytes.write{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Read/Write Bytes by Task"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 6
+                                       x      = 6
+                                       y      = 8
                                    }
                                },
+                               {
+                                   definition = {
+                                       background_color = "gray"
+                                       content          = "Network"
+                                       font_size        = "16"
+                                       show_tick        = true
+                                       text_align       = "center"
+                                       tick_edge        = "right"
+                                       tick_pos         = "50%"
+                                       type             = "note"
+                                       vertical_align   = "center"
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 1
+                                       x      = 0
+                                       y      = 11
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "Received Errors"
+                                                       formula = "query1"
                                                    },
+                                                   {
+                                                       alias   = "Sent Errors"
+                                                       formula = "query2"
                                                    },
+                                                   {
+                                                       alias   = "In Dropped Packets"
+                                                       formula = "query3"
                                                    },
+                                                   {
+                                                       alias   = "Out Dropped Packets"
+                                                       formula = "query4"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:ecs.fargate.net.rcvd_errors{service:$Application.value,env:$Environment.value}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query2"
+                                                       query       = "avg:ecs.fargate.net.sent_errors{service:$Application.value,env:$Environment.value}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query3"
+                                                       query       = "avg:ecs.fargate.net.packet.in_dropped{service:$Application.value,env:$Environment.value}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query4"
+                                                       query       = "avg:ecs.fargate.net.packet.out_dropped{service:$Application.value,env:$Environment.value}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Service Network Errors"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 5
+                                       x      = 1
+                                       y      = 11
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "Received Errors"
+                                                       formula = "query1"
                                                    },
+                                                   {
+                                                       alias   = "Sent Errors"
+                                                       formula = "query2"
                                                    },
+                                                   {
+                                                       alias   = "In Dropped Errors"
+                                                       formula = "query3"
                                                    },
+                                                   {
+                                                       alias   = "Out Dropped Errors"
+                                                       formula = "query4"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:ecs.fargate.net.rcvd_errors{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query2"
+                                                       query       = "avg:ecs.fargate.net.sent_errors{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query3"
+                                                       query       = "avg:ecs.fargate.net.packet.in_dropped{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query4"
+                                                       query       = "avg:ecs.fargate.net.packet.out_dropped{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Network Errors by Task"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 6
+                                       x      = 6
+                                       y      = 11
                                    }
                                },
                            ]
                        }
+                       layout     = {
+                           height = 15
+                           width  = 12
+                           x      = 0
+                           y      = 3
                        }
                    },
                ]
            }
        )
+       dashboard_lists         = (known after apply)
+       dashboard_lists_removed = (known after apply)
+       id                      = (known after apply)
+       url                     = (known after apply)
    }

  # module.basic_dashboard[0].datadog_dashboard_list.this will be created
+ resource "datadog_dashboard_list" "this" {
+       id   = (known after apply)
+       name = "logicalis-poc"
    }

  # module.ecs_application.aws_cloudwatch_log_stream.this will be created
+ resource "aws_cloudwatch_log_stream" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       log_group_name = "/ecs/service/logicalis-poc-prod"
+       name           = "logicalis-poc-prod"
    }

  # module.ecs_application.module.ecs_cluster.aws_ecs_cluster.this will be created
+ resource "aws_ecs_cluster" "this" {
+       arn                = (known after apply)
+       capacity_providers = (known after apply)
+       id                 = (known after apply)
+       name               = "logicalis-poc-prod"
+       tags               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-cluster"
        }
+       tags_all           = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-cluster"
        }

+       default_capacity_provider_strategy {
+           base              = (known after apply)
+           capacity_provider = (known after apply)
+           weight            = (known after apply)
        }

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # module.ecs_application.module.ecs_cluster.aws_ecs_cluster_capacity_providers.this will be created
+ resource "aws_ecs_cluster_capacity_providers" "this" {
+       capacity_providers = [
+           "FARGATE",
+           "FARGATE_SPOT",
        ]
+       cluster_name       = "logicalis-poc-prod"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 0
+           capacity_provider = "FARGATE"
+           weight            = 0
        }
    }

  # module.ecs_application.module.ecs_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 0
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       health_check_grace_period_seconds  = (known after apply)
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "logicalis-poc-prod"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-service"
        }
+       tags_all                           = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-service"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       deployment_circuit_breaker {
+           enable   = true
+           rollback = true
        }

+       load_balancer {
+           container_name   = (known after apply)
+           container_port   = (known after apply)
+           elb_name         = (known after apply)
+           target_group_arn = (known after apply)
        }

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = (known after apply)
+           subnets          = [
+               "subnet-08178094b64355e92",
+               "subnet-0847317e984ba5111",
+               "subnet-0f7ee5b76673dadae",
            ]
        }
    }

  # module.ecs_application.module.ecs_service.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "Security group for logicalis-poc-prod in ECS."
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "All traffic allowed."
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               description      = (known after apply)
+               from_port        = (known after apply)
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = (known after apply)
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = (known after apply)
            },
        ]
+       name                   = "logicalis-poc-prod-ecs-service"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-ecs-service"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-ecs-service"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.ecs_application.module.ecs_task.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
+       arn                      = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   command          = []
+                   cpu              = 0
+                   dockerLabels     = {
+                       com.datadoghq.tags.env     = "prod"
+                       com.datadoghq.tags.service = "logicalis-poc"
                    }
+                   environment      = [
+                       {
+                           name  = "DD_ENV"
+                           value = "prod"
                        },
+                       {
+                           name  = "DD_LOGS_INJECTION"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_PROFILING_ENABLED"
+                           value = "false"
                        },
+                       {
+                           name  = "DD_SERVICE"
+                           value = "logicalis-poc"
                        },
+                       {
+                           name  = "DD_TRACE_SAMPLE_RATE"
+                           value = "1"
                        },
+                       {
+                           name  = "PROFILE"
+                           value = "prod"
                        },
                    ]
+                   essential        = true
+                   image            = "165908609791.dkr.ecr.eu-west-1.amazonaws.com/logicalis-poc:prod"
+                   logConfiguration = {
+                       logDriver = "awsfirelens"
+                       options   = {
+                           Host           = "http-intake.logs.datadoghq.eu"
+                           Name           = "datadog"
+                           TLS            = "on"
+                           apiKey         = "6cc5160dc30036a7aada901c55476837"
+                           dd_message_key = "logs"
+                           dd_service     = "logicalis-poc"
+                           dd_source      = "logicalis-poc"
+                           dd_tags        = "env:prod"
+                           provider       = "ecs"
                        }
                    }
+                   mountPoints      = []
+                   name             = "logicalis-poc-prod"
+                   portMappings     = [
+                       {
+                           containerPort = 8080
+                           hostPort      = 8080
+                           protocol      = "tcp"
                        },
                    ]
+                   secrets          = [
+                       {
+                           name      = "DD_API_KEY"
+                           valueFrom = "arn:aws:secretsmanager:eu-west-1:165908609791:secret:dd_api_key-ZmeHOo"
                        },
                    ]
+                   stopTimeout      = 30
+                   volumesFrom      = []
                },
+               {
+                   cpu              = 10
+                   environment      = [
+                       {
+                           name  = "DD_APM_ENABLED"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_APM_NON_LOCAL_TRAFFIC"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_SITE"
+                           value = "datadoghq.eu"
                        },
+                       {
+                           name  = "ECS_FARGATE"
+                           value = "true"
                        },
                    ]
+                   essential        = true
+                   image            = "public.ecr.aws/datadog/agent:latest"
+                   logConfiguration = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "/ecs/service/logicalis-poc-prod"
+                           awslogs-region        = "eu-west-1"
+                           awslogs-stream-prefix = "ecs"
                        }
                    }
+                   memory           = 256
+                   mountPoints      = []
+                   name             = "logicalis-poc-prod-dd-agent"
+                   portMappings     = [
+                       {
+                           containerPort = 8126
+                           hostPort      = 8126
+                           protocol      = "tcp"
                        },
                    ]
+                   secrets          = [
+                       {
+                           name      = "DD_API_KEY"
+                           valueFrom = "arn:aws:secretsmanager:eu-west-1:165908609791:secret:dd_api_key-ZmeHOo"
                        },
                    ]
+                   stopTimeout      = 30
+                   volumesFrom      = []
                },
+               {
+                   cpu                   = 0
+                   environment           = []
+                   essential             = true
+                   firelensConfiguration = {
+                       options = {
+                           config-file-type        = "file"
+                           config-file-value       = "/fluent-bit/configs/parse-json.conf"
+                           enable-ecs-log-metadata = "true"
                        }
+                       type    = "fluentbit"
                    }
+                   image                 = "public.ecr.aws/aws-observability/aws-for-fluent-bit:stable"
+                   logConfiguration      = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "/ecs/service/logicalis-poc-prod"
+                           awslogs-region        = "eu-west-1"
+                           awslogs-stream-prefix = "ecs"
                        }
                    }
+                   mountPoints           = []
+                   name                  = "logicalis-poc-prod-fluentbit"
+                   portMappings          = []
+                   stopTimeout           = 30
+                   user                  = "0"
+                   volumesFrom           = []
                },
            ]
        )
+       cpu                      = "1024"
+       execution_role_arn       = (known after apply)
+       family                   = "logicalis-poc-prod"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-task-definition"
        }
+       tags_all                 = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-task-definition"
        }
+       task_role_arn            = (known after apply)
    }

  # module.ecs_application.module.ecs_task.aws_iam_role.task_role[0] will be created
+ resource "aws_iam_role" "task_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ecs-execution-role-logicalis-poc-prod"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "ecs-task-logicalis-poc-prod"
+           "Owner"       = "chufis"
        }
+       tags_all              = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "ecs-task-logicalis-poc-prod"
+           "Owner"       = "chufis"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.ecs_application.module.ecs_task.aws_iam_role_policy_attachment.attach_execution_policy_to_role[0] will be created
+ resource "aws_iam_role_policy_attachment" "attach_execution_policy_to_role" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "ecs-execution-role-logicalis-poc-prod"
    }

  # module.ecs_application.module.ecs_service.module.cloudwatch_log_group.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/ecs/service/logicalis-poc-prod"
+       name_prefix       = (known after apply)
+       retention_in_days = 7
+       skip_destroy      = false
+       tags              = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "cloudwatch-log-group"
        }
+       tags_all          = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod"
+           "Owner"       = "chufis"
+           "Resource"    = "cloudwatch-log-group"
        }
    }

  # module.ecs_application.module.ecs_task.module.iam_policy_to_access_needed_secrets[0].aws_iam_role_policy.this will be created
+ resource "aws_iam_role_policy" "this" {
+       id     = (known after apply)
+       name   = "logicalis-poc-prod-secrets"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "secretsmanager:ListSecretVersionIds",
+                           "secretsmanager:GetSecretValue",
+                           "secretsmanager:GetResourcePolicy",
+                           "secretsmanager:DescribeSecret",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:secretsmanager:eu-west-1:165908609791:secret:logicalis-poc-prod-application-*",
+                           "arn:aws:secretsmanager:eu-west-1:165908609791:secret:dd_api_key-ZmeHOo",
                        ]
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_4XX_monitor["prod"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            logicalis-poc-prod-alb Too many 4XX requests. 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-prod] Too many 4XX"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "sum(last_5m):sum:aws.applicationelb.httpcode_target_4xx{application:logicalis-poc,environment:prod} by {host,application}.as_count() > 120"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:prod",
+           "owner:chufis",
+           "resource:alb",
+           "team:engineering",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {}

+       monitor_thresholds {
+           critical = "120"
        }
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_4XX_monitor["staging"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            logicalis-poc-staging-alb Too many 4XX requests. 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-staging] Too many 4XX"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "sum(last_5m):sum:aws.applicationelb.httpcode_target_4xx{application:logicalis-poc,environment:staging} by {host,application}.as_count() > 120"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:staging",
+           "owner:chufis",
+           "resource:alb",
+           "team:engineering",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {}

+       monitor_thresholds {
+           critical = "120"
        }
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_5XX_monitor["prod"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            logicalis-poc-prod is registering an abnormal amount of errors. 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-prod] Too many 5XX"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "sum(last_5m):sum:aws.applicationelb.httpcode_target_5xx{application:logicalis-poc,environment:prod} > 10"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:prod",
+           "owner:chufis",
+           "resource:alb",
+           "team:engineering",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {}

+       monitor_thresholds {
+           critical = "10"
        }
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_5XX_monitor["staging"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            logicalis-poc-staging is registering an abnormal amount of errors. 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-staging] Too many 5XX"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "sum(last_5m):sum:aws.applicationelb.httpcode_target_5xx{application:logicalis-poc,environment:staging} > 10"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:staging",
+           "owner:chufis",
+           "resource:alb",
+           "team:engineering",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {}

+       monitor_thresholds {
+           critical = "10"
        }
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_latency_monitor["prod"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            {{#is_alert}}
            Response latency for logicalis-poc-prod API is abnormally high for host {{host.name}}.
            {{/is_alert}}
            {{#is_recovery}}
            Response latency for logicalis-poc-prod API has returned to normal for host {{host.name}}.
            {{/is_recovery}} 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-prod] Response latency alert"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "avg(last_5m):avg:aws.applicationelb.target_response_time.average{environment:prod,application:logicalis-poc} > 1.2"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:prod",
+           "resource:alb",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {}

+       monitor_thresholds {
+           critical          = "1.2"
+           critical_recovery = "1.1"
        }
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_latency_monitor["staging"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            {{#is_alert}}
            Response latency for logicalis-poc-staging API is abnormally high for host {{host.name}}.
            {{/is_alert}}
            {{#is_recovery}}
            Response latency for logicalis-poc-staging API has returned to normal for host {{host.name}}.
            {{/is_recovery}} 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-staging] Response latency alert"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "avg(last_5m):avg:aws.applicationelb.target_response_time.average{environment:staging,application:logicalis-poc} > 1.2"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:staging",
+           "resource:alb",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {}

+       monitor_thresholds {
+           critical          = "1.2"
+           critical_recovery = "1.1"
        }
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_request_count_monitor["prod"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            There is an anomaly in number of request in logicalis-poc-prod. 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-prod] RequestCount alert"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "avg(last_2w):anomalies(sum:aws.applicationelb.request_count{application:logicalis-poc,environment:prod}.as_count(), 'basic', 3, direction='above', alert_window='last_7d', interval=7200, count_default_zero='true') >= 1"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:prod",
+           "resource:alb",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {
+           recovery_window = "last_15m"
+           trigger_window  = "last_7d"
        }

+       monitor_thresholds {
+           critical          = "1"
+           critical_recovery = "0"
        }
    }

  # module.basic_dashboard[0].module.alb_monitor[0].module.alb_request_count_monitor["staging"].module.this.datadog_monitor.this will be created
+ resource "datadog_monitor" "this" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = (known after apply)
+       id                  = (known after apply)
+       include_tags        = true
+       locked              = false
+       message             = <<-EOT
            There is an anomaly in number of request in logicalis-poc-staging. 
            
            Notify: @slack-chufis-alerts
        EOT
+       name                = "[logicalis-poc-staging] RequestCount alert"
+       new_host_delay      = 300
+       notify_audit        = false
+       notify_no_data      = false
+       priority            = 3
+       query               = "avg(last_2w):anomalies(sum:aws.applicationelb.request_count{application:logicalis-poc,environment:staging}.as_count(), 'basic', 3, direction='above', alert_window='last_7d', interval=7200, count_default_zero='true') >= 1"
+       renotify_interval   = 120
+       require_full_window = true
+       tags                = [
+           "application:logicalis-poc",
+           "deployment:terraform",
+           "env:staging",
+           "resource:alb",
        ]
+       timeout_h           = 0
+       type                = "query alert"

+       monitor_threshold_windows {
+           recovery_window = "last_15m"
+           trigger_window  = "last_7d"
        }

+       monitor_thresholds {
+           critical          = "1"
+           critical_recovery = "0"
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.basic_dashboard.module.alb_monitor.module.alb_4XX_monitor.module.this.datadog_monitor.this,
│   on .terraform/modules/basic_dashboard/datadog/monitors/monitor/monitor.tf line 3, in resource "datadog_monitor" "this":
│    3:   locked              = false
│ 
│ Use `restricted_roles`.
│ 
│ (and 27 more similar warnings elsewhere)
╵

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100   169  100    16  100   153    415   3975 --:--:-- --:--:-- --:--:--  4447
{"status": "ok"}

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod`
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod`
</details>
Plan: 26 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
